spec/dummy/app/views/articles/show.html.erb

SELECT "articles".* FROM "articles" ORDER BY "articles"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
<%=link_to "Same Page", article_url(Article.first)%>